devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
/*=========================================================================*//**
@file    i2c.c

@author  Daniel Zorychta

@brief   This driver support I2C peripherals.

@note    Copyright (C) 2014  Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "core/module.h"
#include <dnx/misc.h>
#include <dnx/thread.h>
#include "stm32f1/i2c_cfg.h"
#include "stm32f1/i2c_def.h"
#include "stm32f1/stm32f10x.h"
#include "lib/stm32f10x_rcc.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define I2C_DEV_CFG(_major, _minor)\
{\
        .addr          = _major##_DEV_##_minor##_ADDRESS,\
        .addr10bit     = _major##_DEV_##_minor##_10BIT_ADDR_MODE,\
        .sub_addr_mode = _major##_DEV_##_minor##_SEND_SUB_ADDRESS,\
        .major         = _major,\
        .minor         = _minor\
}

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
typedef enum {
        I2C_SUB_ADDR_MODE__DISABLED = 0,
        I2C_SUB_ADDR_MODE__1_BYTE   = 1,
        I2C_SUB_ADDR_MODE__2_BYTES  = 2,
        I2C_SUB_ADDR_MODE__3_BYTES  = 3
} I2C_sub_addr_mode_t;

typedef struct {
        const u16_t               addr:16;
        const bool                addr10bit:1;
        const I2C_sub_addr_mode_t sub_addr_mode:2;
        const u8_t                major:4;
        const u8_t                minor:4;
} I2C_dev_config_t;

typedef struct {
        const I2C_t            *const I2C;
        const DMA_Channel_t    *const DMA_tx;
        const DMA_Channel_t    *const DMA_rx;
        const u32_t             freq;
        const u32_t             I2C_clken;
        const bool              use_DMA;
        const u8_t              IRQ_prio;
        const IRQn_Type         IRQ_EV_n;
        const IRQn_Type         IRQ_ER_n;
        const u8_t              num_of_devs; // FIXME is needed?
        const I2C_dev_config_t *const devices;
} I2C_config_t;

typedef struct {
        const I2C_dev_config_t *config;
        dev_lock_t              lock;
} I2C_dev_t;

typedef enum {
        STATE_IDLE,
        STATE_START,
        STATE_ADDRESS_HEADER_SENT,
        STATE_ADDRESS_SENT,
        STATE_SUB_ADDRESS,
        STATE_TRANSFER
} state_t;

typedef struct {
        struct I2C_per {
                mutex_t            *lock;
                sem_t              *event;
                I2C_dev_t          *dev;
                u8_t               *data;
                u32_t               sub_addr;
                size_t              size;
                state_t             state;
                u8_t                dev_cnt;
                I2C_sub_addr_mode_t sub_addr_mode:2;
                bool                addr10rd:1;
                bool                write:1;
                bool                error:1;
                bool                stop:1;
                bool                initialized:1;
        } periph[_I2C_NUMBER_OF_PERIPHERALS];
} I2C_mem_t;


/*==============================================================================
  Local function prototypes
==============================================================================*/
static void release_resources(u8_t major);
static I2C_t *get_I2C(I2C_dev_t *hdl);
static bool enable_I2C(u8_t major);
static void disable_I2C(u8_t major);
static size_t I2C_transmit(I2C_dev_t *hdl, bool sub_addr_mode, u32_t sub_addr, const u8_t *src, size_t size, bool stop);
static size_t I2C_receive(I2C_dev_t *hdl, u8_t *dst, size_t size, bool stop);
static bool IRQ_EV_handler(u8_t major);
static bool IRQ_ER_handler(u8_t major);

/*==============================================================================
  Local object definitions
==============================================================================*/
MODULE_NAME(I2C);

static const uint access_timeout = 30000;
static const uint device_timeout = 2000;
static const u8_t header10b      = 0xF0;

#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
static const I2C_dev_config_t I2C1_dev_cfg[_I2C1_NUMBER_OF_DEVICES] = {
        #if (_I2C1_NUMBER_OF_DEVICES >= 1)
        I2C_DEV_CFG(_I2C1, 0),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 2)
        I2C_DEV_CFG(_I2C1, 1),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 3)
        I2C_DEV_CFG(_I2C1, 2),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 4)
        I2C_DEV_CFG(_I2C1, 3),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 5)
        I2C_DEV_CFG(_I2C1, 4),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 6)
        I2C_DEV_CFG(_I2C1, 5),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 7)
        I2C_DEV_CFG(_I2C1, 6),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 8)
        I2C_DEV_CFG(_I2C1, 7),
        #endif
};
#endif

#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
static const I2C_dev_config_t I2C2_dev_cfg[_I2C2_NUMBER_OF_DEVICES] = {
        #if (_I2C2_NUMBER_OF_DEVICES >= 1)
        I2C_DEV_CFG(_I2C2, 0),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 2)
        I2C_DEV_CFG(_I2C2, 1),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 3)
        I2C_DEV_CFG(_I2C2, 2),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 4)
        I2C_DEV_CFG(_I2C2, 3),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 5)
        I2C_DEV_CFG(_I2C2, 4),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 6)
        I2C_DEV_CFG(_I2C2, 5),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 7)
        I2C_DEV_CFG(_I2C2, 6),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 8)
        I2C_DEV_CFG(_I2C2, 7),
        #endif
};
#endif

static const I2C_config_t I2C_cfg[_I2C_NUMBER_OF_PERIPHERALS] = {
        #if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
        {
                .I2C         = I2C1,
                .freq        = _I2C1_FREQUENCY,
                .use_DMA     = _I2C1_USE_DMA,
                .DMA_tx      = DMA1_Channel6,
                .DMA_rx      = DMA1_Channel7,
                .I2C_clken   = RCC_APB1ENR_I2C1EN,
                .IRQ_prio    = _I2C1_IRQ_PRIO,
                .IRQ_EV_n    = I2C1_EV_IRQn,
                .IRQ_ER_n    = I2C1_ER_IRQn,
                .num_of_devs = _I2C1_NUMBER_OF_DEVICES,
                .devices     = I2C1_dev_cfg
        },
        #endif
        #if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
        {
                .I2C         = I2C2,
                .freq        = _I2C2_FREQUENCY,
                .use_DMA     = _I2C2_USE_DMA,
                .DMA_tx      = DMA1_Channel4,
                .DMA_rx      = DMA1_Channel5,
                .I2C_clken   = RCC_APB1ENR_I2C2EN,
                .IRQ_prio    = _I2C2_IRQ_PRIO,
                .IRQ_EV_n    = I2C2_EV_IRQn,
                .IRQ_ER_n    = I2C2_ER_IRQn,
                .num_of_devs = _I2C2_NUMBER_OF_DEVICES,
                .devices     = I2C2_dev_cfg
        },
        #endif
};

static I2C_mem_t *I2C;


/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(I2C, void **device_handle, u8_t major, u8_t minor)
{
        if (major >= _I2C_NUMBER_OF_PERIPHERALS) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }

