devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
                printk("Timout %d\n", last_state); // TEST

                return false;
        }

        if (I2C->periph[hdl->config->major].error) {
                printk("Error %d\n", last_state); // TEST

                errno = EIO;
                return false;
        }

        return true;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static size_t I2C_transmit(I2C_dev_t *hdl, bool sub_addr_mode, u32_t sub_addr, const u8_t *src, size_t size, bool stop)
{
        printk("transmit\n"); // TEST

        struct I2C_per *per = &I2C->periph[hdl->config->major];

        per->data          = const_cast(u8_t*, src);
        per->size          = size;
        per->stop          = stop;
        per->write         = true;
        per->sub_addr      = sub_addr;
        per->sub_addr_mode = sub_addr_mode ? hdl->config->sub_addr_mode : I2C_SUB_ADDR_MODE__DISABLED;
        per->dev           = hdl;

        per->state = STATE_START;
        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);

        wait_for_event(hdl);

        return size - per->size;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static size_t I2C_receive(I2C_dev_t *hdl, u8_t *dst, size_t size, bool stop)
{
        printk("receive\n"); // TEST

        struct I2C_per *per = &I2C->periph[hdl->config->major];

        per->data          = dst;
        per->size          = size;
        per->stop          = stop;
        per->write         = false;
        per->sub_addr      = 0;
        per->sub_addr_mode = I2C_SUB_ADDR_MODE__DISABLED;
        per->dev           = hdl;

        per->state = STATE_START;
        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);

        wait_for_event(hdl);

        return size - per->size;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool IRQ_EV_handler(u8_t major)
{
        I2C_t          *i2c   = const_cast(I2C_t*, I2C_cfg[major].I2C);
        struct I2C_per *per   = &I2C->periph[major];
        bool            woken = false;


        void error()
        {
                last_state = per->state; //TEST
                woken = IRQ_ER_handler(major);
        }

        void finish()
        {
                per->state = STATE_IDLE;
                CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);

                if (per->stop)
                        SET_BIT(i2c->CR1, I2C_CR1_STOP);

                semaphore_signal_from_ISR(I2C->periph[major].event, &woken);
        }


        switch (per->state) {
        default:
        case STATE_IDLE:
                per->stop     = true;
                per->addr10rd = false;
                finish();
                break;

        case STATE_START:
                if (i2c->SR1 & I2C_SR1_SB) {
                        if (per->dev->config->addr10bit) {
                                if (per->addr10rd) {
                                        per->state    = STATE_ADDRESS_SENT;
                                        per->addr10rd = false;
                                } else {
                                        per->state = STATE_ADDRESS_HEADER_SENT;
                                }

                                i2c->DR = header10b | ((per->dev->config->addr & 0x300) >> 7) | (per->addr10rd ? 1 : 0);

                        } else {
                                per->state = STATE_ADDRESS_SENT;
                                if (per->write) {
                                        i2c->DR = per->dev->config->addr & 0xFE;
                                } else {
                                        if (per->size > 1) {
                                                SET_BIT(i2c->CR1, I2C_CR1_ACK);
                                        } else {
                                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                        }

                                        i2c->DR = per->dev->config->addr | 0x01;
                                }
                        }

                }
                break;

        case STATE_ADDRESS_HEADER_SENT:
                if (i2c->SR1 & I2C_SR1_ADD10) {
                        per->state    = STATE_ADDRESS_SENT;
                        per->addr10rd = !per->write;
                        i2c->DR       = per->dev->config->addr;

                } else {
                        error();
                }
                break;

        case STATE_ADDRESS_SENT:
                if (i2c->SR1 & I2C_SR1_ADDR) {
                        int tmp = i2c->SR2;
                        (void)tmp;

                        if (per->write) {
                                per->state = STATE_SUB_ADDRESS;
                        } else {
                                if (per->dev->config->addr10bit && per->addr10rd) {
                                        per->state = STATE_START;
                                        SET_BIT(i2c->CR1, I2C_CR1_START);
                                        break;
                                }

                                if (per->size == 1) {
                                        SET_BIT(i2c->CR1, I2C_CR1_STOP);
                                }

                                per->state = STATE_TRANSFER;
                        }

                        SET_BIT(i2c->CR2, I2C_CR2_ITBUFEN);
                } else {
                        error();
                }
                break;

        case STATE_SUB_ADDRESS:
                if (i2c->SR1 & I2C_SR1_TXE) {
                        switch (per->sub_addr_mode) {
                        case I2C_SUB_ADDR_MODE__3_BYTES:
                                i2c->DR = per->sub_addr >> 16;
                                per->sub_addr_mode = I2C_SUB_ADDR_MODE__2_BYTES;
                                break;

                        case I2C_SUB_ADDR_MODE__2_BYTES:
                                i2c->DR = per->sub_addr >> 8;
                                per->sub_addr_mode = I2C_SUB_ADDR_MODE__1_BYTE;
                                break;

                        case I2C_SUB_ADDR_MODE__1_BYTE:
                                i2c->DR = per->sub_addr;
                                per->sub_addr_mode = I2C_SUB_ADDR_MODE__DISABLED;
                                break;
                        default:
                                per->state = STATE_TRANSFER;
                        }
                } else {
                        error();
                }
                break;

        case STATE_TRANSFER:
                if (!per->data || !per->size) {
                        finish();

                } else if ((i2c->SR1 & I2C_SR1_TXE) && (i2c->SR2 & I2C_SR2_TRA)) {

                        i2c->DR = *(per->data++);

