devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
                        if (--per->size == 0) {
                                CLEAR_BIT(i2c->CR2, I2C_CR2_ITBUFEN);
                        }

                } else if ((i2c->SR1 & I2C_SR1_RXNE) && !(i2c->SR2 & I2C_SR2_TRA)) {

                        if (per->size == 2) {
                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                SET_BIT(i2c->CR1, I2C_CR1_STOP);
                        } else if (per->size <= 1) {
                                finish();
                        }

                        *(per->data++) = i2c->DR;
                        per->size--;

                } else {
                        error();
                }
                break;
        }

        return woken;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool IRQ_ER_handler(u8_t major)
{
        I2C_t *i2c = const_cast(I2C_t*, I2C_cfg[major].I2C);

        I2C->periph[major].error = true;
        I2C->periph[major].state = STATE_IDLE;

        WRITE_REG(i2c->SR1, 0);
        CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN | I2C_CR2_ITERREN);
        SET_BIT(i2c->CR1, I2C_CR1_STOP);

        bool woken = false;
        semaphore_signal_from_ISR(I2C->periph[major].event, &woken);

        return woken;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel4_IRQHandler(void)
{

}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel5_IRQHandler(void)
{

}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel6_IRQHandler(void)
{

}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel7_IRQHandler(void)
{

}
#endif

/*==============================================================================
  End of file
==============================================================================*/
